import { lang } from 'models/lang';

const bn: lang = {
  mainpage: {
    welcome: 'স্বাগতম!',
    logout: 'বাহির হন',
  },
  notFound: {
    title500: 'দুঃখিত, একটি অভ্যন্তরীণ সার্ভার ত্রুটি ছিল| আমরা আপনার অনুরোধ সম্পূর্ণ করতে পারিনি|',
    description500: 'আমাদের দলকে বিষয়টি সম্পর্কে অবগত করা হয়েছে| অসুবিধার জন্য আমরা ক্ষমাপ্রার্থী|',
    title404: 'দুঃখিত, আপনি যে পৃষ্ঠাটি খুঁজছেন সেটি ওয়েবে নেই|',
    title401: 'দুঃখিত, আপনি এই পৃষ্ঠাটি দেখার জন্য অনুমোদিত নন|',
    title400: 'দুঃখিত, প্রতিক্রিয়া একটি খারাপ অনুরোধ ছিল|',
    description404: 'এটা ২ কারণে হতে পারে:',
    description401: 'এটা ২ কারণে হতে পারে:',
    description400: 'এটা ২ কারণে হতে পারে:',
    reason1400: 'অনুরোধে কিছু অনুপস্থিত বাধ্যতামূলক স্থিতিমাপ আছে, বা',
    reason2400: 'কিছু অপ্রত্যাশিত আচরণ ঘটেছে|',
    reason1401: 'আপনি অনুমোদিত নয়, বা',
    reason2401: 'আপনি সঠিক পৃষ্ঠায় নেই|',
    reason1404: 'আপনি একটি ভুল ইন্টারনেট ঠিকানা লিখেছেন, বা',
    reason2404: 'পৃষ্ঠাটি নিষ্কাশিত বা সরানো হয়েছে|',
    unknownStatus: 'ফিরে আসা স্ট্যাটাসটি অজানা এবং পরিচালনা করা হয়নি|',
    back: 'মূল পৃষ্ঠায় ফিরে যান',
  },
};

export default bn;
